mukymuk/mc/tms320f2802xx.h

#define  EINT()   asm(" clrc INTM")
#define  DINT()   asm(" setc INTM")
#define  ERTM()   asm(" clrc DBGM")
#define  DRTM()   asm(" setc DBGM")
#define  EALLOW() asm(" EALLOW")
#define  EDIS()   asm(" EDIS")
#define  ESTOP0()  asm(" ESTOP0")
#define  IDLE90()  asm(" IDLE")

extern cregister volatile unsigned int IFR;
extern cregister volatile unsigned int IER;

#define Device_cal() ((void(*)(void))0x3D7C80)()

// SPRUFN3D
// TMS320F2802x/TMS320F2802xx Piccolo System Control and Interrupts

#define LOSPCP		(*((volatile uint16_t*)0x00701B))

#define LOSPCP_LSPCLK_MASK					7
#define LOSPCP_LSPCLK_DIV1					0
#define LOSPCP_LSPCLK_DIV2					1
#define LOSPCP_LSPCLK_DIV4					2
#define LOSPCP_LSPCLK_DIV6					3			
#define LOSPCP_LSPCLK_DIV8					4
#define LOSPCP_LSPCLK_DIV10					5
#define LOSPCP_LSPCLK_DIV12					6
#define LOSPCP_LSPCLK_DIV14					7

#define CLKCTL		(*((volatile uint16_t*)0x007012))

#define CLKCTL_NMIRESETSEL_MASK				(1<<15)
#define CLKCTL_NMIRESETSEL_MCLKHS			0
#define CLKCTL_NMIRESETSEL_WATCHDOG			(1<<15)

#define CLKCTL_XTALOSCOFF_MASK				(1<<14)
#define CLKCTL_XTALOSCOFF_ON				0
#define CLKCTL_XTALOSCOFF_OFF				(1<<14)

#define CLKCTL_XCLKINOFF_MASK				(1<<13)
#define CLKCTL_XCLKINOFF_ON					0
#define CLKCTL_XCLKINOFF_OFF				(1<<13)

#define CLKCTL_WDHALTI_MASK					(1<<12)
#define CLKCTL_WDHALTI_ON					0
#define CLKCTL_WDHALTI_OFF					(1<<12)

#define CLKCTL_INTOSC2HALTI_MASK			(1<<11)
#define CLKCTL_INTOSC2HALTI_ON				0
#define CLKCTL_INTOSC2HALTI_OFF				(1<<11)

#define CLKCTL_INTOSC2OFF_MASK				(1<<10)
#define CLKCTL_INTOSC2OFF_ON				0
#define CLKCTL_INTOSC2OFF_OFF				(1<<10)

#define CLKCTL_INTOSC1HALTI_MASK			(1<<9)
#define CLKCTL_INTOSC1HALTI_ON				0
#define CLKCTL_INTOSC1HALTI_OFF				(1<<9)

#define CLKCTL_INTOSC1OFF_MASK				(1<<8)
#define CLKCTL_INTOSC1OFF_ON				0
#define CLKCTL_INTOSC1OFF_OFF				(1<<8)

#define CLKCTL_TMR2CLKPRESCALE_MASK			(7<<5)
#define CLKCTL_TMR2CLKPRESCALE_DIV1			(0<<5)
#define CLKCTL_TMR2CLKPRESCALE_DIV2			(1<<5)
#define CLKCTL_TMR2CLKPRESCALE_DIV4			(2<<5)
#define CLKCTL_TMR2CLKPRESCALE_DIV8			(3<<5)
#define CLKCTL_TMR2CLKPRESCALE_DIV16		(4<<5)

#define CLKCTL_TMR2CLKSRCSEL_MASK			(3<<3)
#define CLKCTL_TMR2CLKSRCSEL_SYSCLKOUT		(0<<3)
#define CLKCTL_TMR2CLKSRCSEL_EXTOSC			(1<<3)
#define CLKCTL_TMR2CLKSRCSEL_INTOSC1		(2<<3)
#define CLKCTL_TMR2CLKSRCSEL_INTOSC2		(3<<3)

#define CLKCTL_WDCLKSRCSEL_MASK				(1<<2)
#define CLKCTL_WDCLKSRCSEL_INTOSC1			0
#define CLKCTL_WDCLKSRCSEL_EXTOSC_INTOSC2	(1<<2)

#define CLKCTL_OSCCLKSRC2SEL_MASK			(1<<1)
#define CLKCTL_OSCCLKSRC2SEL_EXTOSC			0
#define CLKCTL_OSCCLKSRC2SEL_INTOSC2		(1<<1)

#define CLKCTL_OSCCLKSRCSEL_MASK			(1<<0)
#define CLKCTL_OSCCLKSRCSEL_INTOSC1			0
#define CLKCTL_OSCCLKSRCSEL_EXTOSC_INTOSC2	(1<<0)

#define XCLK	(*((volatile uint16_t*)0x007010))

#define XCLK_XCLKINSEL_MASK		(1<<6)
#define XCLK_XCLKINSEL_GPIO38	0
#define XCLK_XCLKINSEL_GPIO19	(1<<6)

#define XCLK_XCLKOUTDIV_MASK	(3<<0)
#define XCLK_XCLKOUTDIV_DIV4	(0<<0)
#define XCLK_XCLKOUTDIV_DIV2	(1<<0)
#define XCLK_XCLKOUTDIV_DIV1	(2<<0)
#define XCLK_XCLKOUTDIV_OFF		(3<<0)

#define PLLSTS	(*((volatile uint16_t*)0x007011))

#define PLLSTS_NORMRDYE_MASK		(1<<16)
#define PLLSTS_NORMRDYE_ENABLE		(1<<16)
#define PLLSTS_NORMRDYE_DISABLE		0

#define PLLSTS_DIVSEL_MASK			(3<<7)
#define PLLSTS_DIVSEL_DIV4			(1<<7)
#define PLLSTS_DIVSEL_DIV2			(2<<7)
#define PLLSTS_DIVSEL_DIV1			(3<<7)

#define PLLSTS_MCLKOFF_MASK			(1<<6)
#define PLLSTS_MCLKOFF_ENABLE		0
#define PLLSTS_MCLKOFF_DISABLE		(1<<6)

#define PLLSTS_OSCOFF_MASK			(1<<5)
#define PLLSTS_OSCOFF_ON			0
#define PLLSTS_OSCOFF_OFF			(1<<5)

#define PLLSTS_MCLKCLR_MASK			(1<<4)
#define PLLSTS_MCLKCLR_RESET		(1<<4)

#define PLLSTS_MCLKSTS_MASK			(1<<3)
#define PLLSTS_MCLKSTS_NORMAL		0
#define PLLSTS_MCLKSTS_MISSING		(1<<3)

#define PLLSTS_PLLOFF_MASK			(1<<2)
#define PLLSTS_PLLOFF_ON			0
#define PLLSTS_PLLOFF_OFF			(1<<2)

#define PLLSTS_PLLLOCKS_MASK		(1<<0)
#define PLLSTS_PLLLOCKS_LOCKING		0
#define PLLSTS_PLLLOCKS_STABLE		(1<<0)

#define PLLCR	(*((volatile uint16_t*)0x007021))

#define PLLCR_DIV_MASK				(0x000F)
#define PLLCR_DIV_BYPASS			0
#define PLLCR_DIV_1					1
#define PLLCR_DIV_2					2
#define PLLCR_DIV_3					3
#define PLLCR_DIV_4					4
#define PLLCR_DIV_5					5
#define PLLCR_DIV_6					6
#define PLLCR_DIV_7					7
#define PLLCR_DIV_8					8
#define PLLCR_DIV_9					9
#define PLLCR_DIV_10				10
#define PLLCR_DIV_11				11
#define PLLCR_DIV_12				(uint16_t)12

#define PCLKCR0	(*((volatile uint16_t*)0x00701C))

#define PCLKCR0_SCIAENCLK_MASK				(1<<10)		// SCI-A clock enable
														//
#define PCLKCR0_SCIAENCLK_DISABLE			0			// The SCI-A module is not clocked. (default)
														//
#define PCLKCR0_SCIAENCLK_ENABLE			(1<<10)		// The SCI-A module is clocked by the low-speed clock (LSPCLK).

#define PCLKCR0_SPIAENCLK_MASK				(1<<8)		// SPI-A clock enable
														//
#define PCLKCR0_SPIAENCLK_DISABLE			0			// The SPI-A module is not clocked. (default)
														//
#define PCLKCR0_SPIAENCLK_ENABLE			(1<<8)		// The SPI-A module is clocked by the low-speed clock (LSPCLK).

#define PCLKCR0_I2CAENCLK_MASK				(1<<4)		// I2C clock enable
														//
#define PCLKCR0_I2CAENCLK_DISABLE			0			// The I2C module is not clocked. (default)
														//
#define PCLKCR0_I2CAENCLK_ENABLE			(1<<4)		// The I2C module is clocked.

#define PCLKCR0_ADCENCLK_MASK				(1<<3)		// ADC clock enable
														//
#define PCLKCR0_ADCENCLK_DISABLE			0			// The ADC is not clocked. (default)
														//
#define PCLKCR0_ADCENCLK_ENABLE				(1<<3)		// The ADC module is clocked

#define PCLKCR0_TBCLKSYNC_MASK				(1<<2)		// ePWM Module Time Base Clock (TBCLK) Sync: Allows the user to
														// globally synchronize all enabled ePWM modules to the time base 
														// clock (TBCLK):
														// 
#define PCLKCR0_TBCLKSYNC_DISABLE			0			// The TBCLK (Time Base Clock) within each enabled ePWM module is 
														// stopped. (default). If, however, the ePWM clock enable bit is set
														// in the PCLKCR1 register, then the ePWM module will still be 
														// clocked by SYSCLKOUT even if TBCLKSYNC is 0.
														//
#define PCLKCR0_TBCLKSYNC_ENABLE			(1<<2)		// All enabled ePWM module clocks are started with the first rising 
														// edge of TBCLK aligned. For perfectly synchronized TBCLKs, the 
														// prescaler bits in the TBCTL register of each ePWM module must be 
														// set identically. The proper procedure for enabling ePWM clocks is 
														// as follows:
														// • Enable ePWM module clocks in the PCLKCR1 register.
														// • Set TBCLKSYNC to 0.
														// • Configure prescaler values and ePWM modes.
														// • Set TBCLKSYNC to 1.

#define PCLKCR0_HRPWMENCLK_MASK				(1<<0)		// HRPWM clock enable
#define PCLKCR0_HRPWMENCLK_DISABLE			0			// HRPWM is not enabled.
#define PCLKCR0_HRPWMENCLK_ENABLE			(1<<0)		// HRPWM is enabled.

#define PCLKCR1	(*((volatile uint16_t*)0x00701C))

#define PCLKCR1_ECAP1ENCLK_MASK				(1<<8)		// eCAP1 clock enable	
#define PCLKCR1_ECAP1ENCLK_DISABLE			0			// The eCAP1 module is not clocked. (default)
#define PCLKCR1_ECAP1ENCLK_ENABLE			(1<<8)		// The eCAP1 module is clocked by the system clock (SYSCLKOUT).

#define PCLKCR1_EPWM4ENCLK_MASK				(1<<3)		// ePWM4 clock enable.
#define PCLKCR1_EPWM4ENCLK_DISABLE 			0   		// The ePWM4 module is not clocked. (default)
#define PCLKCR1_EPWM4ENCLK_ENABLE			(1<<3)  	// The ePWM4 module is clocked by the system clock (SYSCLKOUT).

#define PCLKCR1_EPWM3ENCLK_MASK				(1<<2)		// ePWM3 clock enable.
#define PCLKCR1_EPWM3ENCLK_DISABLE			0   		// The ePWM3 module is not clocked. (default)
#define PCLKCR1_EPWM3ENCLK_ENABLE			(1<<2)  	// The ePWM3 module is clocked by the system clock (SYSCLKOUT).

#define PCLKCR1_EPWM2ENCLK_MASK				(1<<1)		// ePWM2 clock enable.
#define PCLKCR1_EPWM2ENCLK_DISABLE			0   		// The ePWM2 module is not clocked. (default)
#define PCLKCR1_EPWM2ENCLK_ENABLE 			(1<<1)  	// The ePWM2 module is clocked by the system clock (SYSCLKOUT).

#define PCLKCR1_EPWM1ENCLK_MASK				(1<<0)		// ePWM1 clock enable.
#define PCLKCR1_EPWM1ENCLK_DISABLE			0   		// The ePWM1 module is not clocked. (default)
#define PCLKCR1_EPWM1ENCLK_ENABLE			(1<<0)  	// The ePWM1 module is clocked by the system clock (SYSCLKOUT).


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///	CPU INTERRUPT
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#define CPU_INT1          (1 << 0)
#define CPU_INT2          (1 << 1)
#define CPU_INT3          (1 << 2)
#define CPU_INT4          (1 << 3)
#define CPU_INT5          (1 << 4)
#define CPU_INT6          (1 << 5)
#define CPU_INT7          (1 << 6)
#define CPU_INT8          (1 << 7)
#define CPU_INT9          (1 << 8)
#define CPU_INT10         (1 << 9)
#define CPU_INT11         (1 << 10)
#define CPU_INT12         (1 << 11)
#define CPU_INT13         (1 << 12)
#define CPU_INT14         (1 << 13)
#define CPU_DLOGINT       (1 << 14)
#define CPU_RTOSINT       (1 << 15)

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/// PIE
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


#define PIECTRL		(*((volatile uint16_t*)0x000CE0))

