mukymuk/mc/tms320f2802xx.h
#define PIECTRL_PIEVECT_MASK				0xFFFE		// These bits indicate the address within the PIE vector table from which the vector was fetched. The
														// least significant bit of the address is ignored and only bits 1 to 15 of the address is shown. You can
														// read the vector value to determine which interrupt generated the vector fetch.
														// For Example: If PIECTRL = 0x0D27 then the vector from address 0x0D26 (illegal operation) was
														// fetched.
														// 
#define PIECTRL_ENPIE_MASK					1			// Enable vector fetching from PIE vector table.
														// Note: The reset vector is never fetched from the PIE, even when it is enabled. This vector is always
														// fetched from boot ROM.
														// 
#define PIECTRL_ENPIE_DISABLE				0			// If this bit is set to 0, the PIE block is disabled and vectors are fetched from the CPU vector table in
														// boot ROM. All PIE block registers (PIEACK, PIEIFR, PIEIER) can be accessed even when the PIE
														// block is disabled.
														// 
#define PIECTRL_ENPIE_ENABLE				1			// When ENPIE is set to 1, all vectors, except for reset, are fetched from the PIE vector table. The reset
														// vector is always fetched from the boot ROM.

#define PIEACK		(*((volatile uint16_t*)0x000CE1))

// Each bit in PIEACK refers to a specific PIE group. Bit 0 refers to interrupts in PIE group 1 that are
// MUXed into INT1 up to Bit 11, which refers to PIE group 12 which is MUXed into CPU IN T12
// If a bit reads as a 0, it indicates that the PIE can send an interrupt from the respective group to the CPU.
// Writes of 0 are ignored.
// Reading a 1 indicates if an interrupt from the respective group has been sent to the CPU and all
// other interrupts from the group are currently blocked.
// Writing a 1 to the respective interrupt bit clears the bit and enables the PIE block to drive a pulse into
// the CPU interrupt input if an interrupt is pending for that group.

#define PIEACK_MASK					0x0FFF
#define PIEACK_INT1					(1<<0)
#define PIEACK_INT2					(1<<1)
#define PIEACK_INT3					(1<<2)
#define PIEACK_INT4					(1<<3)
#define PIEACK_INT5					(1<<4)
#define PIEACK_INT6					(1<<5)
#define PIEACK_INT7					(1<<6)
#define PIEACK_INT8					(1<<7)
#define PIEACK_INT9					(1<<8)
#define PIEACK_INT10				(1<<9)
#define PIEACK_INT11				(1<<10)
#define PIEACK_INT12				(1<<11)

#define PIEIFR1		(*((volatile uint16_t*)0x000CE3))
#define PIEIFR2		(*((volatile uint16_t*)0x000CE5))
#define PIEIFR3		(*((volatile uint16_t*)0x000CE7))
#define PIEIFR4		(*((volatile uint16_t*)0x000CE9))
#define PIEIFR5		(*((volatile uint16_t*)0x000CEB))
#define PIEIFR6		(*((volatile uint16_t*)0x000CED))
#define PIEIFR7		(*((volatile uint16_t*)0x000CEF))
#define PIEIFR8		(*((volatile uint16_t*)0x000CF1))
#define PIEIFR9		(*((volatile uint16_t*)0x000CF3))
#define PIEIFR10	(*((volatile uint16_t*)0x000CF5))
#define PIEIFR11	(*((volatile uint16_t*)0x000CF7))
#define PIEIFR12	(*((volatile uint16_t*)0x000CF9))

#define PIEIER_INT8					(1<<7)
#define PIEIER_INT7					(1<<6)
#define PIEIER_INT6					(1<<5)
#define PIEIER_INT5					(1<<4)
#define PIEIER_INT4					(1<<3)
#define PIEIER_INT3					(1<<2)
#define PIEIER_INT2					(1<<1)
#define PIEIER_INT1					(1<<0)

#define PIEIER1		(*((volatile uint16_t*)0x000CE2))
#define PIEIER2		(*((volatile uint16_t*)0x000CE4))
#define PIEIER3		(*((volatile uint16_t*)0x000CE6))
#define PIEIER4		(*((volatile uint16_t*)0x000CE8))
#define PIEIER5		(*((volatile uint16_t*)0x000CEA))
#define PIEIER6		(*((volatile uint16_t*)0x000CEC))
#define PIEIER7		(*((volatile uint16_t*)0x000CEE))
#define PIEIER8		(*((volatile uint16_t*)0x000CF0))
#define PIEIER9		(*((volatile uint16_t*)0x000CF2))
#define PIEIER10	(*((volatile uint16_t*)0x000CF4))
#define PIEIER11	(*((volatile uint16_t*)0x000CF6))
#define PIEIER12	(*((volatile uint16_t*)0x000CF8))

#define PIEIFR_INT8					(1<<7)
#define PIEIFR_INT7					(1<<6)
#define PIEIFR_INT6					(1<<5)
#define PIEIFR_INT5					(1<<4)
#define PIEIFR_INT4					(1<<3)
#define PIEIFR_INT3					(1<<2)
#define PIEIFR_INT2					(1<<1)
#define PIEIFR_INT1					(1<<0)

#define PIE_IVT	((PISR*)0x0D00)

#define	PIEACK_ACK_ALL 	0x0FFF				// resets all PIE
#define PIEACK_ACK(i)	(1<<((x)-1))		// Each bit in PIEACK refers to a specific PIE group. Bit 0 refers to interrupts in PIE group 1 that are
											// MUXed into INT1 up to Bit 11, which refers to PIE group 12 which is MUXed into CPU IN T12
											// 
											// If a bit reads as a 0, it indicates that the PIE can send an interrupt from the respective group to the
											// CPU. Writes of 0 are ignored.  
											// 
											// Reading a 1 indicates if an interrupt from the respective group has been 
											// sent to the CPU and all other interrupts from the group are currently blocked.
											// 
											// Writing a 1 to the respective interrupt bit clears the bit and enables the PIE block to drive a pulse into 
											// the CPU interrupt input if an interrupt is pending for that group.



#define PIEIER(x)	RA(((x)-1)*2+0xCE2)		// INT(1-12) Group Enable Register
#define PIEIFR(x)	RA(((x)-1))*2+0xCE3)	// INT(1-12) Group Flag Register


#define GPAMUX1	(*((volatile uint16_t*)0x006F86))

#define GPAMUX1_GPIO12_MASK			(3<<24)
#define GPAMUX1_GPIO12_GPIO			0
#define GPAMUX1_GPIO12_TZ1			(1<<24)
#define GPAMUX1_GPIO12_SCITXDA		(2<<24)

#define GPAMUX1_GPIO7_MASK			(3<<14)
#define GPAMUX1_GPIO7_GPIO			0
#define GPAMUX1_GPIO7_EPWM4B		(1<<14)
#define GPAMUX1_GPIO7_SCIRXDA		(2<<14)

#define GPAMUX1_GPIO6_MASK			(3<<12)
#define GPAMUX1_GPIO6_GPIO			0
#define GPAMUX1_GPIO6_EPWM4A		(1<<12)
#define GPAMUX1_GPIO6_EPWMSYNCI		(2<<12)
#define GPAMUX1_GPIO6_EPWMSYNCO		(3<<12)

#define GPAMUX1_GPIO5_MASK			(3<<10)
#define GPAMUX1_GPIO5_GPIO			0
#define GPAMUX1_GPIO5_EPWM3B		(1<<10)
#define GPAMUX1_GPIO5_ECAP1			(3<<10)

#define GPAMUX1_GPIO4_MASK			(3<<8)
#define GPAMUX1_GPIO4_GPIO			0
#define GPAMUX1_GPIO4_EPWM3A		(1<<8)

#define GPAMUX1_GPIO3_MASK			(3<<6)
#define GPAMUX1_GPIO3_GPIO			0
#define GPAMUX1_GPIO3_EPWM2B		(1<<6)
#define GPAMUX1_GPIO3_COMP2OUT		(3<<6)

