mukymuk/mc/tms320f2802xx.h
#define GPAMUX1_GPIO2_MASK			(3<<4)
#define GPAMUX1_GPIO2_GPIO			0
#define GPAMUX1_GPIO2_EPWM2A		(1<<4)

#define GPAMUX1_GPIO1_MASK			(3<<2)
#define GPAMUX1_GPIO1_GPIO			0
#define GPAMUX1_GPIO1_EPWM1B		(1<<2)
#define GPAMUX1_GPIO1_COMP1OUT		(3<<2)

#define GPAMUX1_GPIO0_MASK			3
#define GPAMUX1_GPIO0_GPIO			0
#define GPAMUX1_GPIO0_EPWM1A		1

#define GPAMUX2	(*((volatile uint16_t*)0x006F88))

#define GPAMUX2_GPIO29_MASK			(3<<26)
#define GPAMUX2_GPIO29_GPIO			0
#define GPAMUX2_GPIO29_SCITXDA		(1<<26)
#define GPAMUX2_GPIO29_SCLA			(2<<26)
#define GPAMUX2_GPIO29_TZ3			(3<<26)

#define GPAMUX2_GPIO28_MASK			(3<<24)
#define GPAMUX2_GPIO28_GPIO			0
#define GPAMUX2_GPIO28_SCIRXDA		(1<<24)
#define GPAMUX2_GPIO28_SDAA			(2<<24)
#define GPAMUX2_GPIO28_TZ2			(3<<24)

#define GPAMUX2_GPIO19_MASK			(3<<6)
#define GPAMUX2_GPIO19_GPIO			0
#define GPAMUX2_GPIO19_SPISTEA		(1<<6)
#define GPAMUX2_GPIO19_SCIRXDA		(2<<6)
#define GPAMUX2_GPIO19_ECAP1		(3<<6)

#define GPAMUX2_GPIO18_MASK			(3<4)
#define GPAMUX2_GPIO18_GPIO			0
#define GPAMUX2_GPIO18_SPICLKA		(1<<4)
#define GPAMUX2_GPIO18_SCITXDA		(2<<4)
#define GPAMUX2_GPIO18_XCLKOUT		(3<<4)


#define GPADIR 		(*((volatile uint32_t*)0x006F8A))
#define GPBDIR 		(*((volatile uint32_t*)0x006F9A))
#define GPASET		(*((volatile uint32_t*)0x006FC2))
#define GPBSET		(*((volatile uint32_t*)0x006FCA))
#define GPACLEAR	(*((volatile uint32_t*)0x006FC4))
#define GPBCLEAR	(*((volatile uint32_t*)0x006FCC))
#define GPATOGGLE	(*((volatile uint32_t*)0x006FC6))
#define GPBTOGGLE   (*((volatile uint32_t*)0x006FCE))

#define GPIO_MASK(io)		(1<<(io))
#define GPIO_INPUT(io)		0
#define GPIO_OUTPUT(io)		(1<<(io))

#define WDCR	(*((volatile uint16_t*)0x007029))

#define WDCR_WDFLAG_MASK		(1<<7)
#define WDCR_WDFLAG_POWER_ON	(0)
#define WDCR_WDFLAG_WATCHDOG	(1<<7)

#define WDCR_WDDIS_MASK			(1<<6)
#define WDCR_WDDIS_DISABLE		(1<<6)
#define WDCR_WDDIS_ENABLE		0

#define WDCR_WDCHK_MASK			(7<<3)
#define WDCR_WDCHK_KEY			(5<<3)
#define WDCR_WDCHK_RESET		0

#define WDCR_WDPS_MASK			(7<<0)
#define WDCR_WDPS_DIV512		0
#define WDCR_WDPS_DIV256		1
#define WDCR_WDPS_DIV128		2
#define WDCR_WDPS_DIV64			3
#define WDCR_WDPS_DIV32			4
#define WDCR_WDPS_DIV16			5
#define WDCR_WDPS_DIV8			6
#define WDCR_WDPS_DIV4			7

#define FOPT (*((volatile uint16_t*)0x000A80))

#define FOPT_ENPIPE_MASK		1
#define FOPT_ENPIPE_DISABLE		0
#define FOPT_ENPIPE_ENABLE		1

#define FBANKWAIT (*((volatile uint16_t*)0x000A86))

#define FBANKWAIT_PAGEWAIT_MASK		(15<<8)
#define FBANKWAIT_PAGEWAIT(c)		(((c)<<8)&FBANKWAIT_PAGEWAIT_MASK)

#define FBANKWAIT_RANDWAIT_MASK		(7<<0)
#define FBANKWAIT_RANDWAIT(c)		(((c)<<0)&FBANKWAIT_RANDWAIT_MASK)

#define RA(x)	(*((volatile uint16_t*)(x)))
												
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///	32-BIT CPU Timers 0/1/2
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#define TIMERTIM(i)		RA((i)*8+0xC00)			// CPU-Timer (0-2) Counter Register
#define TIMERTIMH(i)	RA((i)*8+0xC01)			// CPU-Timer (0-2) Counter Register High 
#define TIMERPRD(i)		RA((i)*8+0xC02)			// CPU-Timer (0-2) Period Register
												// CPU-Timer Period Registers (PRDH:PRD): The PRD register holds the low 16 bits of the 32-bit period. The
												// PRDH register holds the high 16 bits of the 32-bit period. When the TIMH:TIM decrements to zero, the
												// TIMH:TIM register is reloaded with the period value contained in the PRDH:PRD registers, at the start of
												// the next timer input clock cycle (the output of the prescaler). The PRDH:PRD contents are also loaded into
												// the TIMH:TIM when you set the timer reload bit (TRB) in the Timer Control Register (TCR).

#define SET_TIMER_PERIOD(t,p)	TIMERPRD(t) = ((uint16_t)((uint32_t)(p))); TIMERPRDH(t) = ((uint16_t)((uint32_t)(p)>>16))

#define TIMERPRDH(i)	RA((i)*8+0xC03)			// CPU-Timer (0-2) Period Register High
												// CPU-Timer Period Registers (PRDH:PRD): The PRD register holds the low 16 bits of the 32-bit period. The
												// PRDH register holds the high 16 bits of the 32-bit period. When the TIMH:TIM decrements to zero, the
												// TIMH:TIM register is reloaded with the period value contained in the PRDH:PRD registers, at the start of
												// the next timer input clock cycle (the output of the prescaler). The PRDH:PRD contents are also loaded into
												// the TIMH:TIM when you set the timer reload bit (TRB) in the Timer Control Register (TCR).

#define TIMERTPR(i)		RA((i)*8+0xC06)			// CPU-Timer (0-2) Prescale Register

#define TIMER_TPR_PSC(v)	(((v)&0xFF)<<8)		// CPU-Timer Prescale Counter. These bits hold the current prescale count for the timer. For every timer clock
												// source cycle that the PSCH:PSC value is greater than 0, the PSCH:PSC decrements by one. One timer clock
												// (output of the timer prescaler) cycle after the PSCH:PSC reaches 0, the PSCH:PSC is loaded with the contents
												// of the TDDRH:TDDR, and the timer counter register (TIMH:TIM) decrements by one. The PSCH:PSC is also
												// reloaded whenever the timer reload bit (TRB) is set by software. The PSCH:PSC can be checked by reading
												// the register, but it cannot be set directly. It must get its value from the timer divide-down register
												// (TDDRH:TDDR). At reset, the PSCH:PSC is set to 0.
												// 
#define TIMER_TPR_TDDR(v)	((v)&0xFF)			// CPU-Timer Divide-Down. Every (TDDRH:TDDR + 1) timer clock source cycles, the timer counter register
												// (TIMH:TIM) decrements by one. At reset, the TDDRH:TDDR bits are cleared to 0. To increase the overall timer
												// count by an integer factor, write this factor minus one to the TDDRH:TDDR bits. When the prescaler counter
												// (PSCH:PSC) value is 0, one timer clock source cycle later, the contents of the TDDRH:TDDR reload the
												// PSCH:PSC, and the TIMH:TIM decrements by one. TDDRH:TDDR also reloads the PSCH:PSC whenever the
												// timer reload bit (TRB) is set by software.

