mukymuk/mc/tms320f2802xx.h
#define TIMERTPRH(i)	RA((i)*8+0xC07)			// CPU-Timer (0-2) Control Register High

#define TIMER_TPRH_PSCH(v)	(((v)&0xFF)<<8)		// CPU-Timer Prescale Counter. These bits hold the current prescale count for the timer. For every timer clock
												// source cycle that the PSCH:PSC value is greater than 0, the PSCH:PSC decrements by one. One timer clock
												// (output of the timer prescaler) cycle after the PSCH:PSC reaches 0, the PSCH:PSC is loaded with the contents
												// of the TDDRH:TDDR, and the timer counter register (TIMH:TIM) decrements by one. The PSCH:PSC is also
												// reloaded whenever the timer reload bit (TRB) is set by software. The PSCH:PSC can be checked by reading
												// the register, but it cannot be set directly. It must get its value from the timer divide-down register
												// (TDDRH:TDDR). At reset, the PSCH:PSC is set to 0.

#define TIMER_TPRH_TDDRH(v)	((v)&0xFF)			// CPU-Timer Divide-Down. Every (TDDRH:TDDR + 1) timer clock source cycles, the timer counter register
												// (TIMH:TIM) decrements by one. At reset, the TDDRH:TDDR bits are cleared to 0. To increase the overall timer
												// count by an integer factor, write this factor minus one to the TDDRH:TDDR bits. When the prescaler counter
												// (PSCH:PSC) value is 0, one timer clock source cycle later, the contents of the TDDRH:TDDR reload the
												// PSCH:PSC, and the TIMH:TIM decrements by one. TDDRH:TDDR also reloads the PSCH:PSC whenever the
												// timer reload bit (TRB) is set by software.

#define SET_TIMER_PRESCALE(t,p)		TIMERTPR(t) = TIMER_TPR_TDDR(p); TIMERTPRH(t) = TIMER_TPRH_TDDRH((p)>>8)


#define TIMERTCR(i)		RA((i)*8+0xC04)			// CPU-Timer (0-2) Control Register
												//
#define TIMERTCR_TIF_MASK		(1<<15)			// CPU-Timer Interrupt Flag
#define TIMERTCR_TIF_NOT_ZERO	0				// The CPU-Timer has not decremented to zero.
												// Writes of 0 are ignored.
#define TIMERTCR_TIF_ZERO		(1<<15)			// This flag gets set when the CPU-timer decrements to zero.
												// Writing a 1 to this bit clears the flag.
												// 
#define TIMERTCR_TIE_MASK		(1<<14)			// CPU-Timer Interrupt Enable.
#define TIMERTCR_TIE_DISABLE	0				// The CPU-Timer interrupt is disabled.
#define TIMERTCR_TIE_ENABLE		(1<<14)			// The CPU-Timer interrupt is enabled. If the timer decrements to zero, and TIE is set, the
												// timer asserts its interrupt request.
												// 
#define TIMERTCR_FREE_SOFT_MASK		(3<<10)		// CPU-Timer Emulation Modes: These bits are special emulation bits that determine the
												// SOFT state of the timer when a breakpoint is encountered in the high-level language
												// debugger. If the FREE bit is set to 1, then, upon a software breakpoint, the timer
												// continues to run (that is, free runs). In this case, SOFT is a don't care. But if FREE is 0,
												// then SOFT takes effect. In this case, if SOFT = 0, the timer halts the next time the
												// TIMH:TIM decrements. If the SOFT bit is 1, then the timer halts when the TIMH:TIM
												// has decremented to zero.
												//
#define TIMERTCR_FREE_SOFT_HARDSTOP	0			// Stop after the next decrement of the TIMH:TIM (hard stop)
#define TIMERTCR_FREE_SOFT_SOFTSTOP	(1<<10)		// Stop after the TIMH:TIM decrements to 0 (soft stop)
												// In the SOFT STOP mode, the timer generates an interrupt before shutting down (since
												// reaching 0 is the interrupt causing condition).
#define TIMERTCR_FREE_SOFT_FREERUN	(2<<10)		// Free run
												//
#define TIMERTCR_TRB_MASK		(1<<5)			// CPU-Timer Reload bit.
#define TIMERTCR_TRB_RELOAD		(1<<5)			// When you write a 1 to TRB, the TIMH:TIM is loaded with the value in the PRDH:PRD,
												// and the prescaler counter (PSCH:PSC) is loaded with the value in the timer dividedown
												// register (TDDRH:TDDR).
												// 
#define TIMERTCR_TSS_MASK		(1<<4)			// CPU-Timer stop status bit. TSS is a 1-bit flag that stops or starts the CPU-timer.
#define TIMERTCR_TSS_RUNNING	0				// Reads of 0 indicate the CPU-timer is running.  
												// To start or restart the CPU-timer, set TSS to 0. At reset, TSS is cleared to 0 and the
												// CPU-timer immediately starts.
#define TIMERTCR_TSS_STOPPED	(1<<4)			// Reads of 1 indicate that the CPU-timer is stopped.
												// To stop the CPU-timer, set TSS to 1


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///	PWM
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#define TBCTL(i)		RA(((i)-1)*0x40+0x6800)		// Time Base Control Register
													//
#define TBCTL_FREE_SOFT_MASK		(3<<14)			// Emulation Mode Bits. These bits select the behavior of the ePWM time-base counter during
													// emulation events
#define TBCTL_FREE_SOFT_TIMEBASE	0   			// Stop after the next time-base counter increment or decrement
#define TBCTL_FREE_SOFT_CYCLE		(1<<14) 		// Stop when counter completes a whole cycle:
#define TBCTL_FREE_SOFT_FREE_RUN	(2<<14) 		// Free run

#define TBCTL_PHSDIR_MASK			(1<<13) 		// Phase Direction Bit.
													// This bit is only used when the time-base counter is configured in the up-down-count mode. The
													// PHSDIR bit indicates the direction the time-base counter (TBCTR) will count after a synchronization
													// event occurs and a new phase value is loaded from the phase (TBPHS) register. This is
													// irrespective of the direction of the counter before the synchronization event..
													// In the up-count and down-count modes this bit is ignored.
													// 
#define TBCTL_PHSDIR_COUNT_DOWN		(0)				// Count down after the synchronization event.
#define TBCTL_PHSDIR_COUNT_UP		(1<<13)			// Count up after the synchronization event.

#define TBCTL_CLKDIV_MASK			(7<<10)			// Time-base Clock Prescale Bits
													// These bits determine part of the time-base clock prescale value.
													// TBCLK = SYSCLKOUT / (HSPCLKDIV × CLKDIV)
													// 
#define TBCTL_CLKDIV_1				(0<<10)			// /1 (default on reset)
#define TBCTL_CLKDIV_2				(1<<10)
#define TBCTL_CLKDIV_4				(2<<10)
#define TBCTL_CLKDIV_8				(3<<10)
#define TBCTL_CLKDIV_16				(4<<10)
#define TBCTL_CLKDIV_32				(5<<10)
#define TBCTL_CLKDIV_64				(6<<10)
#define TBCTL_CLKDIV_128			(7<<10)
												
#define TBCTL_HSPCLKDIV_MASK		(7<<7)			// High Speed Time-base Clock Prescale Bits
													// These bits determine part of the time-base clock prescale value.
													// TBCLK = SYSCLKOUT / (HSPCLKDIV × CLKDIV)
													// This divisor emulates the HSPCLK in the TMS320x281x system as used on the Event Manager
													// (EV) peripheral.

#define TBCTL_HSPCLKDIV_1			(0<<7)	    	
#define TBCTL_HSPCLKDIV_2			(1<<7)			// /2 (default on reset)
#define TBCTL_HSPCLKDIV_4			(2<<7)      	
#define TBCTL_HSPCLKDIV_6			(3<<7)      	
#define TBCTL_HSPCLKDIV_8			(4<<7)      	
#define TBCTL_HSPCLKDIV_10			(5<<7)      	
#define TBCTL_HSPCLKDIV_12			(6<<7)      	
#define TBCTL_HSPCLKDIV_14			(7<<7)      	

#define TBCTL_SWFSYNC_MASK			(1<<6)			// Software Forced Synchronization Pulse

#define TBCTL_SWFSYNC_FORCE			(1<<6)			// Writing a 0 has no effect and reads always return a 0.
													// Writing a 1 forces a one-time synchronization pulse to be generated.
													// This event is ORed with the EPWMxSYNCI input of the ePWM module.
													// SWFSYNC is valid (operates) only when EPWMxSYNCI is selected by SYNCOSEL = 00.


#define TBCTL_SYNCOSEL_MASK			(3<<4)			// Synchronization Output Select. These bits select the source of the EPWMxSYNCO signal.

#define TBCTL_SYNCOSEL_EPWMXSYNC	0				// EPWMxSYNC
#define TBCTL_SYNCOSEL_CTR_ZERO		(1<<4)			// CTR = zero: Time-base counter equal to zero (TBCTR = 0x0000)
#define TBCTL_SYNCOSEL_CTR_CMPB		(2<<4)  		// CTR = CMPB : Time-base counter equal to counter-compare B (TBCTR = CMPB)
#define TBCTL_SYNCOSEL_DISABLE		(3<<4)  		// Disable EPWMxSYNCO signal


#define TBCTL_PRDLD_MASK			(1<<3)			// Active Period Register Load From Shadow Register Select

